# Дано три славаря: {1: 10, 2: 20}, {3: 30, 4: 40} и {5: 50, 6: 60}. Объединить данные словари в один.

x = {1: 10, 2: 20}
y = {3: 30, 4: 40}
z = {5: 50, 6: 60}
res = x | y | z
print(res)
